
//alert(1);         Выводит на экран предупреждение
//==============================================================================================

//const ask = confirm('Are you here?'); //   Ждет подтверждения от пользователя
//==============================================================================================

//const answer = prompt('Are you 18', '');        // Спрашивает пользователя и сохраняет ответ
//==============================================================================================

//const answers = [];

//answers[0] = prompt('What is your name?', '');
//answers[1] = prompt('How old are you?', '');
//answers[2] = prompt('Are you married?', '');

//console.log(answers[0], answers[1], answers[2]);
//=================================================================================================

//const category = 'toys';
//console.log(`https://someurl.com/${category}/5`);  // `${}` - Косые ковычки
//const user = 'Ivan';
//alert(`Hi, ${user}`);                              // `` - косые ковыски
//=================================================================================================

//let incr = 10,
//    decr = 10;

//incr++;                 // ++ - Увелечивает на 1
//decr--;                 // -- - Уменьшает на 1

//console.log(incr++);      // Увелечивает на 1 при следующем вызове
//console.log(decr--);      // Уменьшает на 1 при следующем вызове

//console.log(5%2);         // % - Возвращает остаток от деления

//console.log(2*4 == 8);      // == - Сравнивает объекты
//console.log(2*4 === 8);     // === - Строгое равентство

//const isChecked = true,
//      isClosed = false;

//console.log(isChecked && isClosed);     // && - Логический оператор И

//console.log(isChecked || isClosed);       // || - Логический оператор ИЛИ

//console.log(isChecked || !isClosed);        // ! - Логический оператор НЕ

//console.log(2 + 2 * 2 != 8);              // != - Логический оператор НЕ РАВНО

